In [2]:
people = {
    "first": ["Griffin", "Jane", "John"],
    "last": ["Sargent", "Doe", "Doe"],
    "email": ["griffin.a.sargent@gmail.com", "jane@email.com", "MikeJ@email.com"]
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)
df

     first     last                        email
0  Griffin  Sargent  griffin.a.sargent@gmail.com
1     Jane      Doe               jane@email.com
2     John      Doe              MikeJ@email.com

# Adding and Removing Columns

In [5]:
#
df['first'] + ' ' + df['last']

0    Griffin Sargent
1           Jane Doe
2           John Doe
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']
df

     first     last                        email        full_name
0  Griffin  Sargent  griffin.a.sargent@gmail.com  Griffin Sargent
1     Jane      Doe               jane@email.com         Jane Doe
2     John      Doe              MikeJ@email.com         John Doe

In [8]:
# Remove our old columns
df.drop(columns=['first','last'], inplace=True)
df

                         email        full_name
0  griffin.a.sargent@gmail.com  Griffin Sargent
1               jane@email.com         Jane Doe
2              MikeJ@email.com         John Doe

In [10]:
df['full_name'].str.split(' ', expand=True)

         0        1
0  Griffin  Sargent
1     Jane      Doe
2     John      Doe

In [12]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)
df

                         email        full_name    first     last
0  griffin.a.sargent@gmail.com  Griffin Sargent  Griffin  Sargent
1               jane@email.com         Jane Doe     Jane      Doe
2              MikeJ@email.com         John Doe     John      Doe

# Adding rows (df.append)

In [14]:
df.append({'first': 'Tony'}, ignore_index=True)

                         email        full_name    first     last
0  griffin.a.sargent@gmail.com  Griffin Sargent  Griffin  Sargent
1               jane@email.com         Jane Doe     Jane      Doe
2              MikeJ@email.com         John Doe     John      Doe
3                          NaN              NaN     Tony      NaN

In [16]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["ironman@avenge.com", "Cap@avenge.com"]
}
df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [23]:
df = df.append(df2, ignore_index=True, sort=False)
df

                         email        full_name    first     last
0  griffin.a.sargent@gmail.com  Griffin Sargent  Griffin  Sargent
1               jane@email.com         Jane Doe     Jane      Doe
2              MikeJ@email.com         John Doe     John      Doe
3           ironman@avenge.com              NaN     Tony    Stark
4               Cap@avenge.com              NaN    Steve   Rogers

# Remove Rows (df.drop)

In [25]:
df.drop(index=4)

                         email        full_name    first     last
0  griffin.a.sargent@gmail.com  Griffin Sargent  Griffin  Sargent
1               jane@email.com         Jane Doe     Jane      Doe
2              MikeJ@email.com         John Doe     John      Doe
3           ironman@avenge.com              NaN     Tony    Stark

In [29]:
# Drop based on a 'WHERE' condition
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                         email        full_name    first     last
0  griffin.a.sargent@gmail.com  Griffin Sargent  Griffin  Sargent
3           ironman@avenge.com              NaN     Tony    Stark
4               Cap@avenge.com              NaN    Steve   Rogers